public/guide/emacs/20230227-doom_emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doom Emacs</h1>
<p>
-&gt; <a href="../../index.html#ID-050e9166-394b-40bb-8135-a45ab4419153">Main</a> -&gt; <a href="../../study/linux/20230428-linux.html#ID-b0d37831-1dcd-47be-ba0b-3bd8a7df063e">Linux</a> / <a href="../../other/main/20230428-bsd.html#ID-5b8d8a26-f3dd-4e50-b144-9eff85eadf96">BSD</a> / <a href="../../system/windows/20230428-windows.html#ID-0b378ebf-dc0b-4fca-825d-1ed7cfcebf1b">Windows</a> -&gt; <a href="../../other/main/20230428-sysapps.html#ID-9be91f09-e446-4d22-931e-c05792d8f582">Sysapps</a>
</p>

<div id="outline-container-org4d4f02e" class="outline-2">
<h2 id="org4d4f02e">Doom Emacs</h2>
<div class="outline-text-2" id="text-org4d4f02e">
<p>
[[][github page] ]
[[][official webpage] ]
<a href="https://github.com/niyumard/Doom-Emacs-Cheat-Sheet">Doom Emacs Cheat Sheet</a>
[[][gentoo wiki] ]
[[][arch wiki] ]
</p>
</div>

<div id="outline-container-org938c68a" class="outline-3">
<h3 id="org938c68a">related</h3>
<div class="outline-text-3" id="text-org938c68a">
<p>
-&gt;<a href="20230428-emacs.html#ID-ceec713c-7576-418e-908f-8084c45f83d4"> Emacs</a>
-&gt; <a href="../org/2023-org_mode.html#ID-6f1167d5-1cf6-49de-9f10-df121e03d42f">Org Mode</a>
-&gt;<a href="../org/2023-org_roam.html#ID-629363f6-5b8f-4771-a03d-2e21d9f61b32"> Org Roam</a>
</p>
</div>
</div>

<div id="outline-container-orgf85170e" class="outline-3">
<h3 id="orgf85170e">package</h3>
<div class="outline-text-3" id="text-orgf85170e">
<p>
arch -&gt; <code>...</code>
gentoo -&gt; <code>...</code>
</p>
</div>
</div>

<div id="outline-container-org6b53206" class="outline-3">
<h3 id="org6b53206">install</h3>
<div class="outline-text-3" id="text-org6b53206">
</div>
<div id="outline-container-orge5951e2" class="outline-4">
<h4 id="orge5951e2">pre-configuration</h4>
</div>
</div>

<div id="outline-container-org9435356" class="outline-3">
<h3 id="org9435356">keybindings</h3>
<div class="outline-text-3" id="text-org9435356">
<p>
doom commands
```
doom sync
doom upgrade
doom doctor
doom env
```
</p>

<p>
doom command pallete commands
```
:q -&gt; will quit and close emacs (will remember PATH because of the daemon)
:e PATH -&gt; let's you edit a file
```
</p>

<p>
keybindings
```
M -&gt; Meta (ALT)
</p>

<p>
M + x -&gt; run any command available on emacs
</p>

<p>
Spc + . -&gt; find-file
Space + f + r -&gt; list recent files
</p>

<p>
Spc + b (buffer) + k (kill) -&gt; kill open buffer
</p>

<p>
SPC + h + r + r -&gt; restart Doom Emacs (remember to save)
</p>

<p>
VIM SPLITS
Ctrl-w + h -&gt; horizontally
Ctrl-w + v -&gt; split vertically
Ctrl-w + w -&gt; change focus
Ctrl-w + c -&gt; close
</p>

<p>
EMACS SPLIT
Space + w + s -&gt; horizontal split
Space + w + v -&gt; vertical split
Space + w + w -&gt; change focus
Space + w + c -&gt; close
```
</p>

<p>
find-file
</p>

<p>
check open buffers with:
```
M-x -&gt; see all buffers
Space + b + n -&gt; next buffer
Space + b + p -&gt; previous buffer
```
</p>

<p>
commands you can do with M-x
```
ibuffer -&gt; see all open buffers
Space + b + i
</p>

<p>
dired -&gt; file manager
Space + .
</p>

<p>
term -&gt; basic terminal emulator
run /bin/bash
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>